/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2014, ownCloud, Inc.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "Konto seadistamine";
"you_need_an_account" = "Sinu seadmes pole $appname kontosid.↩\nRakenduse kasutamiseks pead ühe looma.";

//Login Screen
"testing_connection" = "Ühenduse testimine";
"server_instance_not_found" = "Serverit ei leitud";
"secure_connection_established" = "Turvaühendus loodud";
"https_non_secure_connection_established" = "Suunati ümber ebaturvalisele ühendusele";
"connection_established" = "Ühendus loodud";
"login_details" = "Sisselogimise üksikasjad";
"username" = "Kasutajanimi";
"password" = "Parool";
"login" = "Logi sisse";
"cancel" = "Loobu";
"error_login_message" = "Kasutajatunnus või parool pole õiged";
"ok" = "OK";
"url_sample" = "Serveri aadress https://...";
"forbidden_characters_in_password" = "Selles paroolis on keelatud märke";
"server" = "Server";
"url" = "URL";
"session_expired" = "Seanss on aegunud";
"credentials_different_user" = "Sisestatud kasutaja ei kattu selle konto kasutajaga";
"auth_unsupported_auth_method" = "See server ei toeta seda autentimise viisi";
"saml_server_does_not_give_user_id" = "Server ei tagasta korrektset kasutaja ID-d. Palun võta administraatoriga ühendust";
"authentification_not_valid" = "Ei suuda autoriseerida selle serveriga.";
"error_too_many_http_redirects" = "Ühenduse loomisel tekkis tõrge. Palun proovi uuest.";
"retry" = "Proovi uuesti";
"help_link_login" = "Kas oled uus $appname'i kasutaja?";

//TabBarItems
"settings"="Seaded";
"files_tab"="Failid";

//Uploading
"upload" = "Lae üles";
"account" = "Konto:";
"location" = "Asukoht:";
"photo_albums" = "Fotoalbumid";
"loading" = "Laen ...";
"no_access_to_gallery" = "Palun luba rakenduse $appname juurdepääs fotodele ja videotele. Selle valiku leiad Settings > Privacy > Photos.";
"error" = "Viga";
"upload_failed"="Üleslaadimine ei õnnestunud";
"redirection_problem"="URL-i ümbersuunamise tegevus pole toetatud";

//First View
"menu_upload" = "Laadi üles foto/video";
"menu_folder" = "Uus kaust";
"menu_text_file" = "Uus tekstifail";
"sort_menu_title" = "Sorteeri";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "Newest-Oldest";

//Create/Edit File Text
"create_text_file" = "Create New Text File";
"title_view_new_text_file" = "New Text File";
"title_view_edit_text_file" = "Edit Text File";
"default_text_file_title" = "Uus tekstifail";
"title_text_file_placeholder" = "Title...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "on juba olemas";
"error_file_name_empty" = "File name can not be empty.";
"no_changes_made" = "No changes have been made";
"no_file_downloaded" = "The file is not downloaded, you can not edit it";


//Create Folder
"create_folder" = "Loo uus kaust";
"folder_name" = "Sisesta kausta nimi:";
"save" = "Salvesta";
"folder_exist" = "Sellise nimega kaust on juba olemas. Palun sisesta muu nimi.";
"folder_create_error"="Kausta loomine ebaõnnestus";
"not_show_potrait"="Maastikuvaates pole menüü saadaval. Palun liigu portreevaatesse.";
"not_possible_create_folder" = "Kausta loomine ei õnnestunud.";

//FilesView
"confirm_to_delete_item" = "Kinnita elemendi kustutamine";
"yes" = "Jah";
"no" = "Ei";
"delete_from_device" = "Kas sa tõesti soovid seda faili seadmest kustutada?";
"delete_from_server" = "Kas sa tõesti soovida seda faili serverist kustutada?";
"not_possible_connect_to_server" = "Seekord ei õnnestunud serveriga ühenduda.";
"delete_folder_from_server" = "Kas sa tõesti soovid seda kausta serverist kustutada?";
"delete_local_server" = "Kustuta seadmest ja serverist";
"delete_local" = "Kustuta seadmest";
"delete_server" = "Kustuta serverist";
"error_path" = "Selle kausta avamine ei õnnestunud. Palun tee kindlaks, et see on olemas";
"error_not_permission" = "Sul puudub õigus seda tegevust lõpetada";
"folders" = "kaustad";
"files" = "failid";
"folder" = "kaust";
"file" = "fail";
"more_swipe" = "Rohkem";
"message_not_files" = "Siin pole midagi. Lae midagi üles!";

//Refresh file list
"release_refresh"="Värskendamiseks vabasta...";
"loading_refresh"="Laen ...";
"pull_down_refresh"="Värskendamiseks tõmba alla.";

//Miscelanea
"back" = "Tagasi";

//Preview
"open_with_label" = "Ava rakendusega";
"delete_label"= "Kustuta";

//Open with
"file_cannot_be_opened" = "Faili pole võimalik avada";
"no_app_instaled_to_open_it" = "Selle faili avamiseks sobivat rakendust pole paigaldatud.";

//WTClient messages (Download/Upload)
"establishing_connection" = "Ühenduse loomine";
"not_establishing_connection" = "Ühendust ei saa luua";
"connection_closed" = "Ühendus suletud";
"connection_lost" = "Ühendus kadunud";
"auth_failed" = "Autentimine ei õnnestunud";
"auth_passed" = "Autentimine õnnestus";
"request_file_not_found" = "Soovitud faili ei leitud serverist";
"request_file_not_accesed" = "Soovitud failile puudub juurdepääs";
"unknow_response_server" = "Tõrge. Ootamatu vastus serverist.";
"uploading_data" = "Andmete üleslaadimine";
"downloading_data" = "Andmete allalaadimine";
"transfer_complete" = "Ülekanne õnnestus";
"transfer_failed" = "Ülekanne ei õnnestunud";

//Settings and PinCode
"title_app_pin" = "Parool";
"title_app_pin_and_touchID" = "Passcode & Touch ID";
"enter_app_pin" = "Sisesta parool";
"enter_app_pin_long_description" = "Sisesta parool";
"reenter_app_pin" = "Sisesta parool uuesti";
"remove_app_pin" = "Eemalda parool";
"both_pass_not_same" = "Sisestatud paroolid pole samad";
"app_pin_incorrect" = "Parool pole vale";
"passcode_not_enabled" = "Enable passcode first";
"title_app_touchID" = "Touch ID";
"disconnect_button" = "Lõpeta ühendus sellesse serverisse";
"pin_removed" = "Parool on eemaldatud";
"incorrect_pin" = "Korrektne parool";
"app_pin_stored" = "Parool on salvestatud";
"help" = "Abiinfo";
"recommend_to_friend" = "Soovita sõbrale";
"send_feedback" = "Saada tagasisidet";
"manage_accounts" = "Halda kontosid";
"add_new_account" = "Lisa uus konto";
"save_changes" = "Salvesta";
"add_account" = "Lisa";
"user_exist" = "Sisestatud kasutajatunnus on juba olemas";
"imprint_button" = "Andmed";
"title_instant_upload"="Kohene üleslaadimine";
"title_background_instant_upload" = "Background Instant Upload";
"accounts_section" = "Kontod";
"security_section" = "Turvalisus";
"instant_updloads_section" = "Kohesed üleslaadimised";
"more_section" = "Rohkem";
"unlock_app" = "Unlock $appname";

//Downloading
"can_no_copy_to_gallery" = "Seda faili ei saa galeriisse kopeerida, sest galerii ei saa seda avada";
"file_is_downloading" = "Faili juba laaditakse alla";
"download_file_exist" = "Selle faili avamine ei õnnestunud. Palun tee kindlaks, et see on olemas";
"wait_to_download" = "Allalaadimiseks valmistumine";
"updating" = "Uuendamine";
"msg_while_downloads" = "Seda operatsiooni pole võimalik teha, palun oota kuni allalaadimine lõpetab";

//SSL
"invalid_ssl_cert" = "Saidi identiteedi kontrollimine ei õnnestunud. Kas sa soovid seda sertifikaati ikkagi usaldada?";
"connection_declined" = "Kasutaja keeldus ühendusest";

//Recent view
"recent_now"="sekundit tagasi";
"recent_minutes"="$minutes minutit tagasi";
"recent_minute"="$minutes minut tagasi";
"recent_hours"="$hours tundi tagasi";
"recent_hour"="$hours tund tagasi";
"recent_days"="$days päeva tagasi";
"recent_day"="$days päev tagasi";
"recent_months"="$months kuud tagasi";
"recent_month"="$months kuu tagasi";

"uploads_tab"="Üleslaadimised";
"current_section"="Praegune";
"uploader_section"="Üles laetud";
"nothing_was_upload_recently"="Sellest seadmest pole hiljuti midagi üles laaditud";
"failed_uploader_section"="Ebaõnnestunud üleslaadimised";
"error_credential"="Autentimisandmete tõrge";
"error_destiny_does_not_exist"="Kausta tõrge";
"error_file_exists"="Konflikti tõrge";
"error_permission" = "Õiguse viga";
"error_file_does_not_exist" = "Source file not available on the device";
"error_file_in_background" = "Serveri tõrge";
"error_file_invalid_characters" = "Vigased märgid";
"change_active_user"="Muuda aktiivset kasutajat";
"waiting_for_server"="Serveri ühenduse ootamine";
"waiting_for_upload"="Üleslaadimise ootamine";
"error_permission_alert_message" = "Sul puudub õigus sellesse kausta üleslaadida";
"choose_folder" = "Vali kaust";

//Select Folder View
"upload_label"="Laadi üles kausta";
"create_button"="Lisa";
"choose_button"="Vali";

//Rename
"rename_long_press" = "Nimeta ümber";
"rename_file_title" = "Nimeta ümber";
"enter_new_name" = "Sisesta uus nimi:";
"rename_file_exist" = "Sellise nimega fail on juba olemas. Palun sisesta mõni muu nimi";

//Move
"move_long_press" = "Teisalda";
"move_to_label" = "Teisalda kausta";
"file_exist" = "See fail on juba sihtkaustas olemas";
"override_file" = "Kas sa soovid asendada olemasoleva faili sellega?";
"accept" = "Nõustu";
"error_folder_destiny_is_the_same" = "TÕRGE: kausta pole võimalik iseenda sisse teisaldada";
"original_file_exist" = "Faili ei saa teisaldada. Palun tee kindlaks, et see on olemas";
"original_folder_exist" = "Kausta ei saa teisaldada. Palun tee kindlaks, et see on olemas";

//Download folfer
"download_folder" = "Laadi kaust alla";
"cancel_download" = "Tühista allalaadimine";

//Upload from other apps
"other_apps_title" = "Sihtkoht";
"other_apps_account" = "Konto";
"other_apps_folder" = "Kaust";
"other_apps_file_name" = "Failinimi";
"other_apps_send_to" = "Laadi üles kausta";
"error_moving_file" = "Faili ei saa teisaldada. Palun tee kindlaks, et sihtkaust on olemas";
"forbidden_characters_from_server" = "Nimes on vähemalt üks vigane märk";
"overwritte_title" = "Kirjuta üle";

//Social
"twitter_message" = "Proovi nutiseadmes $twitteruser!";
"facebook_message" = "Proovi $appname oma nutiseadmes!↩\n";
"mail_recommendation_subject" = "Proovi $appname oma nutiseadmes";
"mail_recommendation_body" = "Soovin sind kutsuda kasutama $appname oma nutiseadmes!↩\nLaadi alla siit:";
"device_not_support_mail" = "Please, configure your mail account";
"mail_feedback_subject" = "$appname tagasiside";
"account_not_configure" = "Sinu seadmes pole kontot seadistatud.  Seadistamiseks mine Sätetesse.";

//Storage
"of_storage" = "/";
"occupied_storage" = "hõivatud";
"storage" = "Salvestusmaht";
"storage_upgrade" = "Suurenda salvestusmahtu";

//Jimmies
"this_file_is_older" = "Uuem versioon on saadaval";
"msg_update_file_0_bytes" = "Faili suurus serveris on 0 baiti. Kas sa soovid seadmes olemasolevat faili selle tühjaga üle kirjutada?";

//Shared
"shared_tab" = "Jagatud lingid";
"message_not_shared_files" = "Lingi abil jagatud faile ja kaustu pole veel.";
"message_not_shared_api_support" = "Vabandust, aga selles serveris pole jagamine lubatud. Palun võta administraatoriga ühendust";
"share_link_long_press" = "Jaga";
"unshare_link" = "Tühista lingi jagamine";
"share_not_available_on_this_server" = "Vabandust, aga see funktsioon pole selles serveris lubatud. Palun võta administraatoriga ühendust";
"copy_link" = "Kopeeri link";
"file_to_share_not_exist" = "Seda faili või kausta pole võimalik jagada. Palun tee kindlaks, et see on olemas";
"file_to_unshare_not_exist" = "Selle faili või kausta jagamist pole võimalik eemaldada. Palun tee kindlaks, et see on olemas";
"shared_link_protected_title" = "Sisesta parool";
"shared_link_protected_message" = "Lingi jagamiseks pead selle kaitsmiseks sisestama parooli.";
"pasword_empty" = "Parool ei tohi olla tühi";
"no_pasword" = "Sa pead parooli sisestama";
"get_share_link" = "Hangai jagamise link";
"set_expiration_time" = "Määra aegumise aeg";
"password_protect" = "Parooliga kaitstud";
"allow_editing" = "Luba muutmine";
"default_not_possible_msg" = "It is not possible to do this operation, try later please";
"share_user_group_indicator" = "grupp";
"share_user_federated_indicator" = "remote";
"add_user_or_group_title" = "Lisa kasutaja või grupp";
"share_with_users_or_groups" = "Jaga kasutajate või gruppidega";
"not_share_with_users_yet"= "Not shared with any users yet";
"not_sharee_api_supported" = "Sorry, your server version does not allow share with users. Please contact your administrator";
"share_link_title" = "Jaga linki";
"not_share_link_enabled_capabilities" = "Jagamine pole selles serveris lubatud. Palun võta administraatoriga ühendust";
"shared_link_cannot_remove_password" = "Parooli ei saa eemaldada";
"shared_link_cannot_remove_expiration_date" = "Cannot clear expiration date. Shares are required to have an expiration date";
"shared_link_mail_subject" = "$userName shared »$fileOrFolderName« with you";
"secured_link" = "Turvatud";

//Shared privileges
"title_user_can_edit" = "Saab muuta";
"title_user_can_share" = "aab jagada";
"user_can_create" = "loo";
"user_can_change" = "muuda";
"user_can_delete" = "kustuta";
"title_view_edit_user_privileges" = "Õigused";

//Favorites
"favorite" = "Lemmik";
"unfavorite" = "Eemalda lemmik";
"parent_folder_is_favorite" = "Kaust, mis sisaldab seda faili on juba lemmikute hulgas";

//Available offline
"available_offline" = "Available offline";
"not_available_offline" = "Not available offline";
"parent_folder_is_available_offline_file_child" = "A folder that contains this file is already available offline";
"parent_folder_is_available_offline_folder_child" = "A folder that contains this folder is already available offline";

//Document provider
"error_login_doc_provider" = "Unable to access your account. Please use the $appname app to sign in first.";
"error_sending_file_to_document_picker" = "Faili saatmisel dokumendivalijasse tekkis tõrge";
"error_user_change_in_core_app" = "Rakenduses $appname muudeti kasutajat";
"error_connecting_with_server" = "Ühenduse loomine serveriga ei õnnestunud, palun proovi hiljem uuesti";
"move_doc_provider_button" = "Liiguta sellesse asukohta";
"export_doc_provider_button" = "Ekspordi siia asukohta";

//Instant uploads
"location_not_enabled"="Asukohtateenused pole lubatud";
"message_location_not_enabled"="Please go to Settings and turn on Location Services to enable instant photo uploads in the background.";

"access_photos_library_not_enabled" = "Puudub juurdepääs fotodele";
"message_access_photos_not_enabled" = "Kohese fotode üleslaadimise lubamiseks mine sätetesse ja luba juurdepääs fotodele ning asukohateenused.";

//PDF reader
"page_of_pages" = "/"; //Example: 5 of 10

//Share in
"files_added" = "Failid lisatud";
"files_will_be_upload_next_time" = "The files will start to upload the next time that you open $appname";

//Help Guide main app
"title_help_slide_0" = "Welcome to $appname!";
"message_help_slide_0" = "Pühi lisainfo jaoks";
"title_help_slide_1" = "Kohesed üleslaadimised";
"message_help_slide_1" = "Hoia oma fotod turvalisena";
"title_help_slide_2" = "Halda oma faile";
"message_help_slide_2" = "Sa saad kustutada, liigutada";
"title_help_slide_3" = "Jaga";
"message_help_slide_3" = "Sa saad jagada faile ja kaustasid";
"title_help_slide_4" = "Mitu kontot";
"message_help_slide_4" = "Ühenda kõigi oma pilvedega";
"title_help_slide_5" = "Sinu privaatsed failid sünkroniseeritud igale poole";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "Logi sisse";
"skip_button_help_guide" = "Jäta vahele";

//Account menu
"menu_account_edit" = "Edit credentials";
"menu_account_clear_cache" = "Tühjenda puhver";
"menu_account_log_out" = "Eemalda konto";
